config/conf-ui.org
#+TITLE: Conf UI
#+Last Saved: <2019-August-23 12:38:20>
#+BABEL: :cache yes

Common UI configs

* Enabled Config
 :PROPERTIES:
 :header-args: :tangle yes
 :END:
 
** bulk config
#+BEGIN_SRC emacs-lisp
(set-face-attribute 'default nil
                                        ;:family "Fira Code medium"
                    :family "Consolas"
                    :height 100
                    :weight 'normal
                    :width 'normal)
(load-file (expand-file-name "themes/my-default-theme.el" user-config-directory))

(defun highlight-selected-window ()
  "Highlight selected window with a different background color."
  (walk-windows (lambda (w)
                  (unless (eq w (selected-window))
                    (with-current-buffer (window-buffer w)
                      (buffer-face-set '(:background "gray95"))))))
  (buffer-face-set 'default))
(add-hook 'buffer-list-update-hook 'highlight-selected-window)

(with-system windows-nt
  (load-user-file "conf-ui-windows.el"))

(with-system gnu/linux
  (load-user-file "conf-ui-linux.el"))
#+END_SRC

** windows margin
#+BEGIN_SRC emacs-lisp
(setq-default left-margin-width 3); Define new widths.
(set-window-buffer nil (current-buffer)) ; Use them now.
#+END_SRC


* Disabled Config
 :PROPERTIES:
 :header-args: :tangle no
 :END:
 
